
/*                '888 88888888888 888888888',8888'
                    88 888888888888 8888888',8888'
                     8 8888             ,8',8888'
          ==̲=̲=̲=̲=̲=̲=== 8 8888 ========== ,8 ,̲8̲88̲8_==============
          /  ____/__ 8_̲88̲8̲8̲8̲88̲88̲8̲8̲8__ ,̲8__/ //_/____ _ ____
	     / /  __ / / / /ˊ __ `// ___/ˊ __  /__ ˊ __ `// __ \
	    / /__/ // /_/ // /_/ // /   / /_/ // // /_/ // / / /
	    \_____/ \__,_/ \__,_//_/    \__,_//_/ \__,_//_/ /_/
      ============== 8 8888 ===== ,8',8888' ===============
                    88 8888      ,8',8888888888888 
                   ,88 8888     ,8',888888888888888,
				   
				           ファイナル ゼロ

               Guardian FZ © 2017 - Shuriken Studios LLC          */

#pragma once

namespace GuardianFinalZero
{
	enum CollisionType : uint32_t
	{
		/* ------------------------------ Same as Shooter Library ------------------------------ */

		COLLISIONTYPE_NONE			= 0,

		COLLISIONTYPE_PLAYER		= 1 << 0,
		COLLISIONTYPE_ENEMY			= 1 << 1,

		COLLISIONTYPE_SHIP			= 1 << 2,
		COLLISIONTYPE_PROJECTILE	= 1	<< 3,

		/* ------------------------------------------------------------------------------------- */

		COLLISIONTYPE_MISSILE		= 1 << 4,

		COLLISIONTYPE_POWERUP		= 1 << 5,
		COLLISIONTYPE_EXPLOSION		= 1 << 6

	};
}
